app/Controllers/ProductCategoriesController.php

    public function categories(){
        if ($this->request->is('get')){
            $model=new ProductCategories();
            $data=[
                'records'=>$model->paginate(10),
                'pager'=>$model->pager,
            ];
---
SELECT *
FROM `product_categories`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `product_categories`